
categories_goods = ['Cannabis Lollipops', 'Колпаки ']
description_for_info_pages = {
    "main": """
👋 <b>Добро пожаловать в CBDS_Candies!</b>

Мы сделали покупки удобными:  
🍬 <b>Товары</b> – выбирайте сладости или колпаки.  
🛒 <b>Корзина</b> – проверьте покупки.  
ℹ️ <b>О магазине</b> – узнайте, кто мы.  
💰 <b>Оплата</b> – легко и удобно.  
🚚 <b>Доставка</b> – подробности и сроки.  

<i>Ваше удовольствие — наш приоритет! 💫</i>
""",
    "about": """
<b>Магазин CBDS_Candies:</b>  
⏰ <b>График работы:</b> 12/6 – всегда рады вам!  

💕 <i>Почему мы?</i>  
- Премиальные леденцы и колпаки.  
- Быстрая доставка.  
- Отвечаем в любое время.  

🌱 <b>Наши ценности:</b>  
✔️ Высокие стандарты качества.  
✔️ Уважение к клиенту.  
✔️ Стремление сделать ваш день ярче!  
""",
    "payment": """
<b>💰 Способы оплаты:</b>  

1️⃣ <b>BLIK-код</b> (перевод на карту Польского банка):  
Введите BLIK-код в приложении банка, переведите сумму и отправьте скриншот чеку администратору: @CBDS_support.  

2️⃣ <b>TON Wallet (криптовалюта USDT TRC-20):</b>  
Адрес: <b>TRfqtBcC8TCxB4jDuHxu9BeDikv1gNu3Zu</b>  
❗ <i>Отправляйте только USDT TRC-20! Другие активы не подлежат возврату.</i>  

💬 Возникли вопросы? Наша поддержка всегда готова помочь!  
""",
    "shipping": """
<b>✅ Доставка:</b>  

🚚 <b>Варианты:</b>  
1️⃣ <b>Новая Почта</b> – Краков, Познань, Лодзь, Зеленая-Гура.  
2️⃣ <b>InPost</b> – доставка через почтоматы в те же города.  

📦 <b>Обработка заказов:</b>  
Все заказы оформляются в течение 1 рабочего дня после оплаты.  
После отправки вы получите номер отслеживания.  

🏠 <b>Самовывоз</b>: Только в Вроцлаве.  

❌ <b>Не отправляем:</b> Иными службами доставки.  
""",
    "catalog": "<b>📌 Категории товаров:</b> 🍭",
    "cart": "<i>🛒 В корзине нет товаров!</i>",
    "order": "<b>📦 Оформление заказа</b>",
}
